In [74]:
import pandas as pd

In [75]:
campaign_master = pd.read_csv("../input/campaign_master.csv")
len(campaign_master)

3

In [76]:
campaign_master.head()

  campaign_id campaign_name
0         CA1            通常
1         CA2         入会費半額
2         CA3         入会費無料

In [77]:
class_master = pd.read_csv("../input/class_master.csv")
len(class_master)

3

In [78]:
class_master.head()

  class class_name  price
0   C01     オールタイム  10500
1   C02      デイタイム   7500
2   C03        ナイト   6000

In [79]:
customer_master = pd.read_csv("../input/customer_master.csv")
len(customer_master)

4192

In [80]:
customer_master.head()

,customer_id,name,class,gender,start_date,end_date,campaign_id,is_deleted
0,OA832399,XXXX,C01,F,2015-05-01 00:00:00,NaN,CA1,0
1,PL270116,XXXXX,C01,M,2015-05-01 00:00:00,NaN,CA1,0
2,OA974876,XXXXX,C01,M,2015-05-01 00:00:00,NaN,CA1,0
3,HD024127,XXXXX,C01,F,2015-05-01 00:00:00,NaN,CA1,0
4,HD661448,XXXXX,C03,F,2015-05-01 00:00:00,NaN,CA1,0

In [81]:
use_log = pd.read_csv("../input/use_log.csv")
len(use_log)

197428

In [82]:
use_log.head()

            log_id customer_id     usedate
0  L00000049012330    AS009373  2018-04-01
1  L00000049012331    AS015315  2018-04-01
2  L00000049012332    AS040841  2018-04-01
3  L00000049012333    AS046594  2018-04-01
4  L00000049012334    AS073285  2018-04-01

In [83]:
join_data = pd.merge(
    customer_master,
    class_master,
    on="class",
    how="left",
)
join_data = pd.merge(
    join_data,
    campaign_master,
    on="campaign_id",
    how="left",
)

join_data.head()

,customer_id,name,class,gender,start_date,end_date,campaign_id,is_deleted,class_name,price,campaign_name
0,OA832399,XXXX,C01,F,2015-05-01 00:00:00,NaN,CA1,0,オールタイム,10500,通常
1,PL270116,XXXXX,C01,M,2015-05-01 00:00:00,NaN,CA1,0,オールタイム,10500,通常
2,OA974876,XXXXX,C01,M,2015-05-01 00:00:00,NaN,CA1,0,オールタイム,10500,通常
3,HD024127,XXXXX,C01,F,2015-05-01 00:00:00,NaN,CA1,0,オールタイム,10500,通常
4,HD661448,XXXXX,C03,F,2015-05-01 00:00:00,NaN,CA1,0,ナイト,6000,通常

In [84]:
join_data.isnull().sum()

customer_id         0
name                0
class               0
gender              0
start_date          0
end_date         2842
campaign_id         0
is_deleted          0
class_name          0
price               0
campaign_name       0
dtype: int64

In [85]:
join_data.groupby("class_name").count()["customer_id"]

class_name
オールタイム    2045
デイタイム     1019
ナイト       1128
Name: customer_id, dtype: int64

In [86]:
join_data.groupby("campaign_name").count()["customer_id"]

campaign_name
入会費半額     650
入会費無料     492
通常       3050
Name: customer_id, dtype: int64

In [87]:
join_data.groupby("gender").count()["customer_id"]

gender
F    1983
M    2209
Name: customer_id, dtype: int64

In [88]:
join_data.groupby("is_deleted").count()["customer_id"]

is_deleted
0    2842
1    1350
Name: customer_id, dtype: int64

In [89]:
join_data["start_date"] = pd.to_datetime(join_data["start_date"])
customer_start = join_data.loc[join_data["start_date"] > pd.to_datetime("20180401")]
len(customer_start)

1361

In [90]:
join_data["end_date"] = pd.to_datetime(join_data["end_date"])
customer_newer = join_data.loc[
    (join_data["end_date"] >= pd.to_datetime("20190331")) | (join_data["end_date"].isna())
]
len(customer_newer)

2953

In [91]:
customer_newer["end_date"].unique()

array([                          'NaT', '2019-03-31T00:00:00.000000000'],
      dtype='datetime64[ns]')

In [92]:
customer_newer.groupby("class_name").count()["customer_id"]

class_name
オールタイム    1444
デイタイム      696
ナイト        813
Name: customer_id, dtype: int64

In [93]:
customer_newer.groupby("campaign_name").count()["customer_id"]

campaign_name
入会費半額     311
入会費無料     242
通常       2400
Name: customer_id, dtype: int64

In [94]:
customer_newer.groupby("gender").count()["customer_id"]

gender
F    1400
M    1553
Name: customer_id, dtype: int64

In [95]:
use_log["usedate"] = pd.to_datetime(use_log["usedate"])
use_log["年月"] = use_log["usedate"].dt.strftime("%Y%m")
uselog_months = use_log.groupby(
    ["年月", "customer_id"], 
    as_index=False
).count()

uselog_months.rename(
    columns={"log_id":"count"},
    inplace=True
)

uselog_months = pd.DataFrame(uselog_months)
#uselog_months
uselog_months = uselog_months.drop("usedate", axis=1)
uselog_months.head()

       年月 customer_id  count
0  201804    AS002855      4
1  201804    AS009013      2
2  201804    AS009373      3
3  201804    AS015315      6
4  201804    AS015739      7

In [96]:
uselog_customer = uselog_months.groupby("customer_id").agg(["mean", "median", "max", "min"])["count"]
uselog_customer = uselog_customer.reset_index(drop=False)
uselog_customer.head()

  customer_id      mean  median  max  min
0    AS002855  4.500000     5.0    7    2
1    AS008805  4.000000     4.0    8    1
2    AS009013  2.000000     2.0    2    2
3    AS009373  5.083333     5.0    7    3
4    AS015233  7.545455     7.0   11    4

In [97]:
use_log.head()

            log_id customer_id    usedate      年月
0  L00000049012330    AS009373 2018-04-01  201804
1  L00000049012331    AS015315 2018-04-01  201804
2  L00000049012332    AS040841 2018-04-01  201804
3  L00000049012333    AS046594 2018-04-01  201804
4  L00000049012334    AS073285 2018-04-01  201804

In [98]:
use_log["weekday"] = use_log["usedate"].dt.weekday

uselog_weekday = use_log.groupby(
    ["customer_id", "年月", "weekday"], 
    as_index=False
).count()[["customer_id", "年月", "weekday", "log_id"]]

uselog_weekday.rename(columns={"log_id":"count"}, inplace=True)

uselog_weekday.head()

  customer_id      年月  weekday  count
0    AS002855  201804        5      4
1    AS002855  201805        2      1
2    AS002855  201805        5      4
3    AS002855  201806        5      5
4    AS002855  201807        1      1

In [99]:
selog_weekday = uselog_weekday.groupby("customer_id", as_index=False).max()[["customer_id", "count"]]
uselog_weekday["routine_flg"] = 0
uselog_weekday["routine_flg"] = uselog_weekday["routine_flg"].where(uselog_weekday["count"] < 4, 1)
uselog_weekday.head()

  customer_id      年月  weekday  count  routine_flg
0    AS002855  201804        5      4            1
1    AS002855  201805        2      1            0
2    AS002855  201805        5      4            1
3    AS002855  201806        5      5            1
4    AS002855  201807        1      1            0

In [102]:
join_data = pd.merge(
    join_data, 
    uselog_customer, 
    on="customer_id",
    how="left",
)

join_data = pd.merge(
    join_data, 
    uselog_weekday[["customer_id", "routine_flg"]], 
    on="customer_id",
    how="left",
)

join_data.head()

,customer_id,name,class,gender,start_date,end_date,campaign_id,is_deleted,class_name,price,campaign_name,mean,median,max,min,routine_flg
0,OA832399,XXXX,C01,F,2015-05-01,NaT,CA1,0,オールタイム,10500,通常,4.833333,5.0,8,2,0
1,OA832399,XXXX,C01,F,2015-05-01,NaT,CA1,0,オールタイム,10500,通常,4.833333,5.0,8,2,0
2,OA832399,XXXX,C01,F,2015-05-01,NaT,CA1,0,オールタイム,10500,通常,4.833333,5.0,8,2,1
3,OA832399,XXXX,C01,F,2015-05-01,NaT,CA1,0,オールタイム,10500,通常,4.833333,5.0,8,2,1
4,OA832399,XXXX,C01,F,2015-05-01,NaT,CA1,0,オールタイム,10500,通常,4.833333,5.0,8,2,0

In [103]:
join_data.isnull().sum()

customer_id          0
name                 0
class                0
gender               0
start_date           0
end_date         73671
campaign_id          0
is_deleted           0
class_name           0
price                0
campaign_name        0
mean                 0
median               0
max                  0
min                  0
routine_flg          0
dtype: int64

In [105]:
join_data[["mean", "median", "max", "min"]].describe()

               mean        median           max           min
count  93333.000000  93333.000000  93333.000000  93333.000000
mean       5.632080      5.573731      8.348183      3.080936
std        1.488784      1.592073      1.692409      1.739029
min        1.000000      1.000000      1.000000      1.000000
25%        4.583333      4.500000      7.000000      2.000000
50%        5.333333      5.000000      8.000000      3.000000
75%        6.666667      6.500000     10.000000      4.000000
max       12.000000     12.000000     14.000000     12.000000